app/controllers/web_users_controller.rb

  def create
    success = true
    logout_keeping_session!
    @web_user = WebUser.new(params[:web_user])
    if params[:web_user][:accept_tos] == "0"
      success=false
      @web_user.errors.add("", "You must accept the terms of service to sign up")
    end
    success = success && verify_recaptcha(@web_user) if @web_user
    if success && @web_user.save
---
INSERT INTO `web_users` (`name`, `salt`, `updated_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `is_admin`, `password_reset_code`, `remember_token`, `login`, `email`, `created_at`) VALUES('', 'a5deacdf0f28abf6519db22d31e0834d6d157ab9', '2009-09-04 01:27:46', NULL, 'a256a8f5fd4c9b8ca69d458df67c2469f61b9c67', NULL, '7a80e3149c11f96f89c37e74aa02420a064c5556', 0, NULL, NULL, 'quire', 'quire@example.com', '2009-09-04 01:27:46')